# В фермерском хозяйстве в Карелии выращивают чернику. 
# Она растёт на круглой грядке, причём кусты высажены только по окружности. 
# Таким образом, у каждого куста есть ровно два соседних. Всего на грядке растёт N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло различное число ягод — на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники. Эта система состоит из управляющего модуля и нескольких собирающих модулей. 
# Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом, собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, которое может собрать за один заход собирающий модуль, находясь перед некоторым кустом заданной во входном файле грядки

def Random_list(len, left_range, right_range):
    from random import randint

    numbers = []
    for i in range(len):
        numbers.append(randint(left_range, right_range))
    return numbers

n = int(input('Количество кустов: '))
a = Random_list(n, 0, 100)

max_sum = 0
for i in range(1, n-1):
    curr_sum = a[i] + a[i-1] + a[i+1]
    if curr_sum > max_sum:
        max_sum = curr_sum

print(max_sum)